results/raw/k3_bench_8k1k_graph_cap1024.txt
### tag=8k1k_graph_cap1024
### started=2026-09-02T04:05:47Z
### client: isl=8192 osl=1024 num_prompts=32 concurrency=16
### container=k3-v2-unified port=30000
### server argv: -m sglang.launch_server --model-path /models/Kimi-K3 --trust-remote-code --tp-size 8 --ep-size 8 --moe-a2a-backend deepep_v2 --deepep-v2-mode direct --moe-runner-backend deep_gemm --chunked-prefill-size 1024 --max-prefill-tokens 1024 --disable-radix-cache --mem-fraction-static 0.85 --mamba-full-memory-ratio 0.86 --host 0.0.0.0 --port 30000 --decode-log-interval 1 --watchdog-timeout 1000000 --dist-timeout 7200 
### server CAP:  SGLANG_DEEPEP_V2_NUM_MAX_DISPATCH_TOKENS_PER_RANK=1024
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model=None, served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, flush_cache_timeout=60.0, warmup_requests=2, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/models/Kimi-K3', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, flush_cache_timeout=60.0, warmup_requests=2, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
#Input tokens: 262144
#Output tokens: 32768
Starting warmup with 2 sequences...
Warmup completed with 2 sequences. Starting main benchmark run...
100%|██████████| 32/32 [02:52<00:00,  5.40s/it]
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 16        
Successful requests:                     32        
Benchmark duration (s):                  172.77    
Total input tokens:                      262144    
Total input text tokens:                 262144    
Total generated tokens:                  32768     
Total generated tokens (retokenized):    32768     
Request throughput (req/s):              0.19      
Input token throughput (tok/s):          1517.32   
Output token throughput (tok/s):         189.67    
Peak output token throughput (tok/s):    368.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          1706.99   
Concurrency:                             16.00     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   86357.70  
Median E2E Latency (ms):                 86357.69  
P90 E2E Latency (ms):                    86549.04  
P95 E2E Latency (ms):                    86549.56  
P99 E2E Latency (ms):                    86550.27  
---------------Time to First Token----------------
Mean TTFT (ms):                          22537.76  
Median TTFT (ms):                        22571.74  
P90 TTFT (ms):                           39071.32  
P95 TTFT (ms):                           40582.22  
P99 TTFT (ms):                           41914.92  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          62.39     
Median TPOT (ms):                        62.34     
P90 TPOT (ms):                           78.58     
P95 TPOT (ms):                           80.16     
P99 TPOT (ms):                           81.61     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           62.39     
Median ITL (ms):                         43.54     
P90 ITL (ms):                            43.73     
P95 ITL (ms):                            43.77     
P99 ITL (ms):                            43.88     
Max ITL (ms):                            39176.44  
==================================================
### finished=2026-09-02T04:09:10Z rc=0