results/raw/k3_bench_8k1k_nograph_cap2048.txt
### tag=8k1k_nograph_cap2048
### started=2026-09-02T04:14:10Z
### client: isl=8192 osl=1024 num_prompts=32 concurrency=16
### container=k3-v2-unified port=30000
### server argv: -m sglang.launch_server --model-path /models/Kimi-K3 --trust-remote-code --tp-size 8 --ep-size 8 --moe-a2a-backend deepep_v2 --deepep-v2-mode direct --moe-runner-backend deep_gemm --chunked-prefill-size 2048 --max-prefill-tokens 2048 --disable-radix-cache --disable-cuda-graph --mem-fraction-static 0.85 --mamba-full-memory-ratio 0.86 --host 0.0.0.0 --port 30000 --decode-log-interval 1 --watchdog-timeout 1000000 --dist-timeout 7200 
### server CAP:  SGLANG_DEEPEP_V2_NUM_MAX_DISPATCH_TOKENS_PER_RANK=2048
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model=None, served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, flush_cache_timeout=60.0, warmup_requests=2, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/models/Kimi-K3', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, flush_cache_timeout=60.0, warmup_requests=2, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
#Input tokens: 262144
#Output tokens: 32768
Starting warmup with 2 sequences...
Warmup completed with 2 sequences. Starting main benchmark run...
100%|██████████| 32/32 [09:25<00:00, 17.67s/it]
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 16        
Successful requests:                     32        
Benchmark duration (s):                  565.55    
Total input tokens:                      262144    
Total input text tokens:                 262144    
Total generated tokens:                  32768     
Total generated tokens (retokenized):    32768     
Request throughput (req/s):              0.06      
Input token throughput (tok/s):          463.52    
Output token throughput (tok/s):         57.94     
Peak output token throughput (tok/s):    64.00     
Peak concurrent requests:                32        
Total token throughput (tok/s):          521.46    
Concurrency:                             16.00     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   282765.53 
Median E2E Latency (ms):                 282765.95 
P90 E2E Latency (ms):                    283027.54 
P95 E2E Latency (ms):                    283027.90 
P99 E2E Latency (ms):                    283028.60 
---------------Time to First Token----------------
Mean TTFT (ms):                          11733.14  
Median TTFT (ms):                        11735.66  
P90 TTFT (ms):                           20162.69  
P95 TTFT (ms):                           21036.30  
P99 TTFT (ms):                           21792.54  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          264.94    
Median TPOT (ms):                        264.94    
P90 TPOT (ms):                           273.15    
P95 TPOT (ms):                           274.08    
P99 TPOT (ms):                           274.86    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           264.94    
Median ITL (ms):                         255.24    
P90 ITL (ms):                            256.06    
P95 ITL (ms):                            256.32    
P99 ITL (ms):                            256.98    
Max ITL (ms):                            20507.72  
==================================================
### finished=2026-09-02T04:24:11Z rc=0